content/imported/tutorials/partitioned-pipe/fluid2-openfoam-sonicliquidfoam/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            fixedGradient;
        gradient        uniform (0 0 0);
    }
    fixedWalls
    {
        type            noSlip;
    }
}
