content/imported/tutorials/partitioned-pipe/fluid2-openfoam-sonicliquidfoam/system/decomposeParDict
FoamFile {
    version     2.0;
    class       dictionary;
    object      decomposeParDict;
    format      ascii;
}

numberOfSubdomains 2;

method          simple;

simpleCoeffs
{
    n               (2 1 1);
    delta           0.001;
}
